#ifndef CLINICCHARGE_H
#define CLINICCHARGE_H

#include <QWidget>
#include "stdafx.h"
#include "subform.h"

namespace Ui {
class ClinicCharge;
}

class ClinicCharge : public SubForm
{
    Q_OBJECT
    
public:
    explicit ClinicCharge(SubForm *parent = 0);
    ~ClinicCharge();
public slots:
    void newTableFile();

private:

    //-----------------------------------------------------------------------------------------------------------------------------------
    // 名称：init
    // 作用：创建门诊收费窗体中所有控件
    // 参数：无
    // 返回值：无
    // 备注：无
    // 时间：2016-04-15
    //-----------------------------------------------------------------------------------------------------------------------------------
    void init();

    //-----------------------------------------------------------------------------------------------------------------------------------
    // 名称：CreatePatientPart
    // 作用：创建患者信息部分控件并编组
    // 参数：无
    // 返回值：无
    // 备注：无
    // 时间：2016-04-15
    //-----------------------------------------------------------------------------------------------------------------------------------
    void CreatePatientPart();

    //-----------------------------------------------------------------------------------------------------------------------------------
    // 名称：CreateSocialSecurityPart
    // 作用：创建社保信息部分控件并编组
    // 参数：无
    // 返回值：无
    // 备注：无
    // 时间：2016-04-15
    //-----------------------------------------------------------------------------------------------------------------------------------
    void CreateSocialSecurityPart();

    //-----------------------------------------------------------------------------------------------------------------------------------
    // 名称：CreateDoctorPart
    // 作用：创建医生信息部分控件并编组
    // 参数：无
    // 返回值：无
    // 备注：无
    // 时间：2016-04-15
    //-----------------------------------------------------------------------------------------------------------------------------------
    void CreateDoctorPart();

    //-----------------------------------------------------------------------------------------------------------------------------------
    // 名称：CreateIncomePart
    // 作用：创建收入信息部分控件并编组
    // 参数：无
    // 返回值：无
    // 备注：无
    // 时间：2016-04-15
    //-----------------------------------------------------------------------------------------------------------------------------------
    void CreateIncomePart();

    //-----------------------------------------------------------------------------------------------------------------------------------
    // 名称：CreateChargeTablePart
    // 作用：创建收费表格信息部分控件
    // 参数：无
    // 返回值：无
    // 备注：无
    // 时间：2016-04-15
    //-----------------------------------------------------------------------------------------------------------------------------------
    void CreateChargeTablePart();

    //-----------------------------------------------------------------------------------------------------------------------------------
    // 名称：SetMyLayout
    // 作用：将门诊收费界面所有控件进行布局
    // 参数：无
    // 返回值：无
    // 备注：无
    // 时间：2016-04-15
    //-----------------------------------------------------------------------------------------------------------------------------------
    void SetMyLayout();

    //-----------------------------------------------------------------------------------------------------------------------------------
    // 名称：UpdateChargeTable
    // 作用：从数据库中读取收费单，并更新至界面
    // 参数：无
    // 返回值：无
    // 备注：功能还未实现
    // 时间：2016-04-15
    //-----------------------------------------------------------------------------------------------------------------------------------
    void UpdateChargeTable();

private:
    Ui::ClinicCharge *ui;
    //-----------------------------------------------------------------------------------------------------------------------------------
    // - 界面控件
    //-----------------------------------------------------------------------------------------------------------------------------------
    QLabel *chargeNumLabel;                 // 收费单号
    QLabel *nameLabel;                      // 姓名
    QLabel *genderLabel;                    // 性别
    QLabel *ageLabel;                       // 年龄
    QLabel *idCardNumLabel;                 // 身份证号码
    QLabel *socialSecurityNumLabel;         // 社保号码
    QLabel *medicalInsuranceTypeLabel;      // 医保类型
    QLabel *departmentLabel;                // 科室
    QLabel *doctorLabel;                    // 医生
    QLabel *dueIncomeLabel;                 // 应收金额
    QLabel *realIncomeLabel;                // 实收金额

    QLineEdit *chargeNumEdit;               // 收费单号
    QLineEdit *nameEdit;                    // 姓名
    QLineEdit *ageEdit;                     // 年龄
    QLineEdit *idCardNumEdit;               // 身份证号码
    QLineEdit *socialSecurityNumEdit;       // 社保号码
    QLineEdit *departmentEdit;              // 科室
    QLineEdit *doctorEdit;                  // 医生
    QLineEdit *dueIncomeEdit;               // 应收金额
    QLineEdit *realIncomeEdit;              // 实收金额

    QComboBox *genderCombo;                 // 性别
    QComboBox *medicalInsuranceTypeCombo;   // 医保类型


    QTableView *chargeTableView;            // 收费明细表

    QGroupBox *patientGroup;                // 患者信息组
    QGroupBox *insuranceGroup;              // 医保信息组
    QGroupBox *doctorGroup;                 // 医生信息组
    QGroupBox *incomeGroup;                 // 应收信息组
    QGroupBox *chargeNumGroup;              // 实收信息组

    //-----------------------------------------------------------------------------------------------------------------------------------
    // - 数据操作
    //-----------------------------------------------------------------------------------------------------------------------------------
    QSqlTableModel *chargeTableModel;       // 收费明细表数据库操作
};

#endif // CLINICCHARGE_H
